const express = require("express");
const app = express();
const port = 3000;

app.get("/", (req, res) => {
  res.send("Hello World!");
});

const response = {
    "organization": "Калужский государственный университет им. К.Э. Циолковского",
    "title": "Расписание",
    "description": "учебных занятий на 2-ой семестр 2022-2023 уч. года",
    "institute": "инженерно-технологического института",
    "data": [
      {
        "group": "Б-Арх-11",
        "monday": {
          "1": {
            "first": {
              "title": "Начертательная геометрия (Лк)",
              "period": "13.02.23 - 24.04.23, 22.05.23 - 05.06.23"
            },
            "second": {
              "title": "История искусств",
              "period": "13.02.23 - 24.04.23, 22.05.23 - 05.06.23"
            }
          },
          "2": {
              "title": "Экономическая культура и финансовая грамотность",
              "period": "13.02.23 - 24.04.23"
          },
          "3": {
            "first": {
                "title": "Эмоциональный интеллект (Пр)",
                "teacher": "Кабанов К.В."
            },
            "second": {
                "title": "Философия",
                "teacher": "Максимов М.А."
            },
          },
          "4": {
            "second": {
                "title": "Информационно-коммуникационные технологии (Лк)",
                "teacher": "Виноградский В.Г.",
            }
          },
        },
        "tuesday": {
          "1": {
              "title": "Экономическая культура и финансовая грамотность (Лк)",
              "teacher": "Крутиков В.К."
            },
           "2": {
              "title": "История (история России, всеобщая история)",
              "teacher": "Штепа А.В., Власов А.Е.",
           },
           "3": {
              "first": { "title": "Химия (Пр)", "teacher": "Парамонов"},
              "second": {"title": "История искусств", "teacher": "Бахлова Н.А."}
           }
          },
        "wednesday": {
          "2": {
            "first": {
              "title": "Эмоциональный интеллект"
            }
          },
          "3": {
            "title": "Композиционное моделирование",
            "teacher": "Бахлова",
          },
          "4": {
            "title": "Иностранный язык",
            "teacher": "Кулабухов"
          }
        },
        "thursday": {
            "3": {
              "first": {
                "title": "Эмоциональный интеллект"
              }
            },
            "4": {
              "title": "Композиционное моделирование",
              "teacher": "Бахлова",
            },
            "5": {
              "title": "Иностранный язык",
              "teacher": "Кулабухов"
            }
          },
        "friday": {
            "3": {
              "first": {
                "title": "Химия",
                "teacher": "Парамонова В.В."
              },
              "second": {
                "title": "Экономическая культура и финансовая грамотность (Пр)",
                "teacher": "Мельниченко Т.Ю."
              }
            },
            "4": {
              "title": "Композиционное моделирование",
              "teacher": "Бахлова",
            },
            "5": {
              "title": "Иностранный язык",
              "teacher": "Кулабухов"
            }
          },
        "saturday": {
            "1": {
                "first": {
                  "title": "Инностранный язык (Инд)",
                  "teacher": "Кулабухов Н.В."
                },
                "second": {
                  "title": "Иностранный язык (Пр)",
                  "teacher": "Кулабухов Н.В."
                }
              },
              "2": {
                "title": "Физика (Пр)",
                "teacher": "Куликов А.Н.",
              },
        }
      },
      {
        "group": "Б-ГиМУ-11",
        "monday": {
          "1": {
            "first": {
              "title": "Теория управления (Лк)",
              "period": "13.02.23 - 24.04.23, 22.05.23 - 05.06.23"
            },
            "second": {
              "title": "Базовые информационные технологии",
              "period": "13.02.23 - 24.04.23, 22.05.23 - 05.06.23"
            }
          },
          "2": {
            "first": {
              "title": "Экономическая культура и финансовая грамотность",
              "period": "13.02.23 - 24.04.23"
            }
          }
        },
        "tuesday": {
          "1": {
            "first": {
              "title": "Экономическая культура и финансовая грамотность (Лк)"
            }
          }
        },
        "wednesday": {
          "2": {
            "first": {
              "title": "Эмоциональный интеллект"
            }
          }
        },
        "thursday": {
            "3": {
              "first": {
                "title": "Эмоциональный интеллект"
              }
            },
            "4": {
              "title": "Композиционное моделирование",
              "teacher": "Бахлова",
            },
            "5": {
              "title": "Иностранный язык",
              "teacher": "Кулабухов"
            }
          },
        "friday": {
            "3": {
              "first": {
                "title": "Химия",
                "teacher": "Парамонова В.В."
              },
              "second": {
                "title": "Экономическая культура и финансовая грамотность (Пр)",
                "teacher": "Мельниченко Т.Ю."
              }
            },
            "4": {
              "title": "Композиционное моделирование",
              "teacher": "Бахлова",
            },
            "5": {
              "title": "Иностранный язык",
              "teacher": "Кулабухов"
            }
          },
        "saturday": {
            "1": {
                "first": {
                  "title": "Инностранный язык (Инд)",
                  "teacher": "Кулабухов Н.В."
                },
                "second": {
                  "title": "Иностранный язык (Пр)",
                  "teacher": "Кулабухов Н.В."
                }
              },
              "2": {
                "title": "Физика (Пр)",
                "teacher": "Куликов А.Н.",
              },
        }
      }
    ]
  };

app.get("/getCalendar", (req, res) => {
    res.json(response)
})

app.post("/getCalendar", (req, res) => {
    res.json(response)
})

app.listen(port, () => {
  console.log(`Example app listening on port ${port}`);
});
